; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v10 ?v11)
             (pred_7 ?v12 ?v1)
             (pred_8 ?v10 ?v1)
             (pred_12 ?v5 ?v10 )
	     (pred_5 ?v10)
             (pred_9 ?v2)
             (pred_11 ?v12)
             (pred_6 ?v1)
             (pred_1 ?v10)
             (pred_4 ?v12)
             (pred_3 ?v10)
             (pred_2 ))



(:action op_4
:parameters (?v8 ?v9 ?v3 ?v13)
:precondition (and (pred_9 ?v8) (pred_9 ?v9) (pred_11 ?v3) (pred_6 ?v13)
          (pred_10 ?v8 ?v9) (pred_7 ?v3 ?v13)
                   (pred_8 ?v9 ?v13) (pred_5 ?v8) 
                   (pred_1 ?v9) (pred_4 ?v3))
:effect (and  (pred_3 ?v9) (not (pred_1 ?v9))))


(:action op_3
:parameters (?v8 ?v7)
:precondition (and (pred_9 ?v8) (pred_9 ?v7)
               (pred_5 ?v8) (pred_10 ?v8 ?v7) (pred_3 ?v7))
:effect (and (pred_5 ?v7) (not (pred_5 ?v8))))

(:action op_5
:parameters (?v8 ?v3)
:precondition (and (pred_9 ?v8) (pred_11 ?v3) 
                  (pred_5 ?v8) (pred_12 ?v3 ?v8) (pred_2 ))
:effect (and (pred_4 ?v3)
   (not (pred_12 ?v3 ?v8)) (not (pred_2 ))))


(:action op_1
:parameters (?v8 ?v6 ?v4)
:precondition (and (pred_9 ?v8) (pred_11 ?v6) (pred_11 ?v4)
                  (pred_5 ?v8) (pred_4 ?v4) (pred_12 ?v6 ?v8))
:effect (and (pred_4 ?v6) (pred_12 ?v4 ?v8)
        (not (pred_4 ?v4)) (not (pred_12 ?v6 ?v8))))

(:action op_2
:parameters (?v8 ?v3)
:precondition (and (pred_9 ?v8) (pred_11 ?v3) 
                  (pred_5 ?v8) (pred_4 ?v3))
:effect (and (pred_2 ) (pred_12 ?v3 ?v8) (not (pred_4 ?v3)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_17 obj_14 obj_05 obj_16 obj_03 obj_25 obj_02 obj_04 obj_12 obj_11 obj_28 obj_18 obj_26 obj_27 obj_01 obj_13 obj_07 obj_19 obj_30 obj_21 obj_09 obj_10 obj_08 obj_31 obj_23
    obj_15 obj_22 obj_24
    obj_06 obj_20 obj_29
    )

    (:init
       (pred_2)

       (pred_9 obj_17)
       (pred_9 obj_14)
       (pred_9 obj_05)
       (pred_9 obj_16)
       (pred_9 obj_03)
       (pred_9 obj_25)
       (pred_9 obj_02)
       (pred_9 obj_04)
       (pred_9 obj_12)
       (pred_9 obj_11)
       (pred_9 obj_28)
       (pred_9 obj_18)
       (pred_9 obj_26)
       (pred_9 obj_27)
       (pred_9 obj_01)
       (pred_9 obj_13)
       (pred_9 obj_07)
       (pred_9 obj_19)
       (pred_9 obj_30)
       (pred_9 obj_21)
       (pred_9 obj_09)
       (pred_9 obj_10)
       (pred_9 obj_08)
       (pred_9 obj_31)
       (pred_9 obj_23)
       (pred_6 obj_15)
       (pred_6 obj_22)
       (pred_6 obj_24)
       (pred_11 obj_06)
       (pred_11 obj_20)
       (pred_11 obj_29)

       (pred_10 obj_17 obj_25)
       (pred_10 obj_17 obj_14)
       (pred_10 obj_14 obj_02)
       (pred_10 obj_14 obj_05)
       (pred_10 obj_14 obj_17)
       (pred_10 obj_05 obj_04)
       (pred_10 obj_05 obj_16)
       (pred_10 obj_05 obj_14)
       (pred_10 obj_16 obj_12)
       (pred_10 obj_16 obj_03)
       (pred_10 obj_16 obj_05)
       (pred_10 obj_03 obj_11)
       (pred_10 obj_03 obj_16)
       (pred_10 obj_25 obj_28)
       (pred_10 obj_25 obj_02)
       (pred_10 obj_25 obj_17)
       (pred_10 obj_02 obj_18)
       (pred_10 obj_02 obj_04)
       (pred_10 obj_02 obj_14)
       (pred_10 obj_02 obj_25)
       (pred_10 obj_04 obj_26)
       (pred_10 obj_04 obj_12)
       (pred_10 obj_04 obj_05)
       (pred_10 obj_04 obj_02)
       (pred_10 obj_12 obj_27)
       (pred_10 obj_12 obj_11)
       (pred_10 obj_12 obj_16)
       (pred_10 obj_12 obj_04)
       (pred_10 obj_11 obj_01)
       (pred_10 obj_11 obj_03)
       (pred_10 obj_11 obj_12)
       (pred_10 obj_28 obj_13)
       (pred_10 obj_28 obj_18)
       (pred_10 obj_28 obj_25)
       (pred_10 obj_18 obj_07)
       (pred_10 obj_18 obj_26)
       (pred_10 obj_18 obj_02)
       (pred_10 obj_18 obj_28)
       (pred_10 obj_26 obj_19)
       (pred_10 obj_26 obj_27)
       (pred_10 obj_26 obj_04)
       (pred_10 obj_26 obj_18)
       (pred_10 obj_27 obj_30)
       (pred_10 obj_27 obj_01)
       (pred_10 obj_27 obj_12)
       (pred_10 obj_27 obj_26)
       (pred_10 obj_01 obj_21)
       (pred_10 obj_01 obj_11)
       (pred_10 obj_01 obj_27)
       (pred_10 obj_13 obj_09)
       (pred_10 obj_13 obj_07)
       (pred_10 obj_13 obj_28)
       (pred_10 obj_07 obj_10)
       (pred_10 obj_07 obj_19)
       (pred_10 obj_07 obj_18)
       (pred_10 obj_07 obj_13)
       (pred_10 obj_19 obj_08)
       (pred_10 obj_19 obj_30)
       (pred_10 obj_19 obj_26)
       (pred_10 obj_19 obj_07)
       (pred_10 obj_30 obj_31)
       (pred_10 obj_30 obj_21)
       (pred_10 obj_30 obj_27)
       (pred_10 obj_30 obj_19)
       (pred_10 obj_21 obj_23)
       (pred_10 obj_21 obj_01)
       (pred_10 obj_21 obj_30)
       (pred_10 obj_09 obj_10)
       (pred_10 obj_09 obj_13)
       (pred_10 obj_10 obj_08)
       (pred_10 obj_10 obj_07)
       (pred_10 obj_10 obj_09)
       (pred_10 obj_08 obj_31)
       (pred_10 obj_08 obj_19)
       (pred_10 obj_08 obj_10)
       (pred_10 obj_31 obj_23)
       (pred_10 obj_31 obj_30)
       (pred_10 obj_31 obj_08)
       (pred_10 obj_23 obj_21)
       (pred_10 obj_23 obj_31)
       (pred_1 obj_14)
       (pred_1 obj_07)
       (pred_1 obj_19)
       (pred_8  obj_14 obj_15)
       (pred_8  obj_07 obj_22)
       (pred_8  obj_19 obj_24)
       (pred_3 obj_17)
       (pred_3 obj_05)
       (pred_3 obj_16)
       (pred_3 obj_03)
       (pred_3 obj_25)
       (pred_3 obj_02)
       (pred_3 obj_04)
       (pred_3 obj_12)
       (pred_3 obj_11)
       (pred_3 obj_28)
       (pred_3 obj_18)
       (pred_3 obj_26)
       (pred_3 obj_27)
       (pred_3 obj_01)
       (pred_3 obj_13)
       (pred_3 obj_30)
       (pred_3 obj_21)
       (pred_3 obj_09)
       (pred_3 obj_10)
       (pred_3 obj_08)
       (pred_3 obj_31)
       (pred_3 obj_23)

       (pred_7  obj_06 obj_15)
       (pred_7  obj_20 obj_22)
       (pred_7  obj_29 obj_24)
       (pred_12 obj_06 obj_25)
       (pred_12 obj_20 obj_26)
       (pred_12 obj_29 obj_05)
       (pred_5 obj_21)
    )

    (:goal (and
       (pred_12 obj_29 obj_13)
    ))
(:constraints
  (always (not (pred_5 obj_04)))
)
)

; plan
1. (op_3 obj_21 obj_30)
   deleted: (pred_5 obj_21)
   added: (pred_5 obj_30)
   goals met: 0 of 1
2. (op_3 obj_30 obj_27)
   deleted: (pred_5 obj_30)
   added: (pred_5 obj_27)
   goals met: 0 of 1
3. (op_3 obj_27 obj_12)
   deleted: (pred_5 obj_27)
   added: (pred_5 obj_12)
   goals met: 0 of 1
4. (op_3 obj_12 obj_16)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_16)
   goals met: 0 of 1
5. (op_3 obj_16 obj_05)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_05)
   goals met: 0 of 1
6. (op_5 obj_05 obj_29)
   deleted: (pred_12 obj_29 obj_05) (pred_2)
   added: (pred_4 obj_29)
   goals met: 0 of 1
7. (op_3 obj_05 obj_16)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_16)
   goals met: 0 of 1
8. (op_3 obj_16 obj_12)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_12)
   goals met: 0 of 1
9. (op_3 obj_12 obj_27)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_27)
   goals met: 0 of 1
10. (op_3 obj_27 obj_26)
   deleted: (pred_5 obj_27)
   added: (pred_5 obj_26)
   goals met: 0 of 1
11. (op_3 obj_26 obj_18)
   deleted: (pred_5 obj_26)
   added: (pred_5 obj_18)
   goals met: 0 of 1
12. (op_3 obj_18 obj_28)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_28)
   goals met: 0 of 1
13. (op_3 obj_28 obj_13)
   deleted: (pred_5 obj_28)
   added: (pred_5 obj_13)
   goals met: 0 of 1
14. (op_2 obj_13 obj_29)
   deleted: (pred_4 obj_29)
   added: (pred_2) (pred_12 obj_29 obj_13)
   goals met: 1 of 1
